Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The classifier matching the version of the platform may look confusing at first. But this is what turns the descriptor into a true "fingerprint" of the platform. In both Maven and Gradle, the effective set of the dependency version constraints (or the managed dependencies) is obtained by merging all the imported BOMs and version constraints specified individually in the current project and also its parent(s). The artifact `classifier` is a part of the dependency ID, which could be expressed as `groupId:artifactId:classifier:type`. Which means that if a project imports a couple of BOMs, e.g. `org.apple:apple-bom::pom:1.0` and `org.orange:orange-bom::pom:1.0`, and each of these two BOMs imports a different version `io.quarkus.platform:quarkus-bom::pom`, the Quarkus tools will be able to detect this fact and make the user aware of it, since it *might* not be a safe combination. If the descriptor artifact didn't include the classifer containing the version of the platform then the tools wouldn't be able to detect a potentially incompatible mix of different versions of the same platform in the same project.
ja_jp: プラットフォームのバージョンと一致する分類子は、最初は混乱するように見えるかもしれません。しかし、これこそが記述子をプラットフォームの真の「フィンガープリント」に変えるものなのです。MavenとGradleの両方において、依存バージョン制約（または管理された依存関係）の有効セットは、現在のプロジェクトとその親（複数）において個別に指定されたすべてのインポートBOMとバージョン制約をマージすることによって得られます。アーティファクト `classifier` は、依存関係IDの一部であり、 `groupId:artifactId:classifier:type` と表現することができます。つまり、プロジェクトがいくつかのBOM（例えば、 `org.apple:apple-bom::pom:1.0` と `org.orange:orange-bom::pom:1.0` ）をインポートし、これら2つのBOMのそれぞれが異なるバージョン `io.quarkus.platform:quarkus-bom::pom` をインポートする場合、安全な組み合わせとは *言えない* ため、Quarkusツールはこの事実を検出し、ユーザーに認識させることが可能です。もし、記述子アーティファクトにプラットフォームのバージョンを含むclassiferが含まれていなければ、ツールは、同じプロジェクトに同じプラットフォームの異なるバージョンが混在している可能性を検出することができないでしょう。

source: The classifier matching the version of the platform may look confusing at first. But this is what turns the descriptor into a true "fingerprint" of the platform. In both Maven and Gradle, the effective set of the dependency version constraints (or the managed dependencies) is obtained by merging all the imported BOMs and version constraints specified individually in the current project and also its parent(s). The artifact `classifier` is a part of the dependency ID, which could be expressed as `groupId:artifactId:classifier:type`. Which means that if a project imports a couple of BOMs, e.g. `org.apple:apple-bom::pom:1.0` and `org.orange:orange-bom::pom:1.0`, and each of these two BOMs imports a different version `io.quarkus.platform:quarkus-bom::pom`, the Quarkus tools will be able to detect this fact and make the user aware of it, since it *might* not be a safe combination. If the descriptor artifact didn't include the classifier containing the version of the platform then the tools wouldn't be able to detect a potentially incompatible mix of different versions of the same platform in the same project.
ja_jp: プラットフォームのバージョンにマッチする分類は、最初は混乱するように見えるかもしれません。しかし、これがディスクリプタをプラットフォームの真の「フィンガープリント」に変えるものです。MavenとGradleの両方で、依存関係のバージョン制約（または管理された依存関係）の有効なセットは、現在のプロジェクトで個別に指定されたすべてのインポートされたBOMとバージョン制約、およびその親をマージすることによって得られます。アーティファクト `classifier` は依存関係 ID の一部であり、 `groupId:artifactId:classifier:type` と表現できます。つまり、プロジェクトがいくつかのBOM、例えば、 `org.apple:apple-bom::pom:1.0` と `org.orange:orange-bom::pom:1.0` をインポートし、これら2つのプラットフォームが異なるバージョンの `io.quarkus.platform:quarkus-bom::pom` に基づいている場合、Quarkusツールは安全な組み合わせではない *かもしれない* 事実を検知し、ユーザーに認識させることができます。もし記述子のアーティファクトにプラットフォームのバージョンを含む分類子が含まれていなかった場合、ツールは、同じプロジェクト内で同じプラットフォームの異なるバージョンが混在していても、互換性がない可能性があることを検出することはできません。

source: The classifier matching the version of the platform may look confusing at first. But this is what turns the descriptor into a true "fingerprint" of the platform. In both Maven and Gradle, the effective set of the dependency version constraints (or the managed dependencies) is obtained by merging all the imported BOMs and version constraints specified individually in the current project and also its parent(s). The artifact `classifier` is a part of the dependency ID, which could be expressed as `groupId:artifactId:classifier:type`. Which means that if a project imports a couple of BOMs, e.g. `org.apple:apple-bom::pom:1.0` and `org.orange:orange-bom::pom:1.0`, and each of these two BOMs imports a different version `{quarkus-platform-groupid}:quarkus-bom::pom`, the Quarkus tools will be able to detect this fact and make the user aware of it, since it *might* not be a safe combination. If the descriptor artifact didn't include the classifier containing the version of the platform then the tools wouldn't be able to detect a potentially incompatible mix of different versions of the same platform in the same project.
ja_jp: プラットフォームのバージョンにマッチする分類子は、最初は混乱するように見えるかもしれません。しかし、これは記述子をプラットフォームの真の「フィンガープリント」に変えるものです。MavenとGradleの両方で、依存バージョン制約（または管理された依存関係）の効果的なセットは、現在のプロジェクトとその親（複数可）で個別に指定されたすべてのインポートされたBOMとバージョン制約をマージすることによって得られます。アーティファクト `classifier` は、依存関係IDの一部であり、 `groupId:artifactId:classifier:type` と表すことができます。つまり、プロジェクトが2つのBOM、例えば `org.apple:apple-bom::pom:1.0` と `org.orange:orange-bom::pom:1.0` をインポートし、これら2つのBOMがそれぞれ異なるバージョン `{quarkus-platform-groupid}:quarkus-bom::pom` をインポートする場合、Quarkusツールはこの事実を検出し、安全な組み合わせではない *可能性がある* ため、ユーザーに認識させることができます。もし、記述子アーティファクトにプラットフォームのバージョンを含む分類子が含まれていなければ、ツールは、同じプロジェクトに同じプラットフォームの異なるバージョンが混在している可能性を検出できないでしょう。

source: The clear method takes one parameter called `name`
ja_jp: clear メソッドは `name` と呼ばれるパラメーターを 1 つ受け取ります。

source: The client API also includes <<client-connectors,connectors>> that are used to configure and create new WebSocket connections.
ja_jp: クライアント API には、新しい WebSocket 接続を設定および作成するために使用される <<client-connectors,connectors>> も含まれています。

source: The client also needs some configuration, namely at least the URL of the remote service. We can either specify that within the `@GraphQLClientApi` annotation (by setting the `endpoint` parameter), or move this over to the configuration file, `application.properties`:
ja_jp: クライアントにも設定が必要で、少なくともリモートサービスのURLが必要です。これは、 `@GraphQLClientApi` アノテーション内で指定する（ `endpoint` パラメータを設定する）か、設定ファイル（ `application.properties` ）に移すことができます:

source: The client connects to the 'lon-site'.
ja_jp: クライアントは 'lon-site' に接続します。

source: The client connects to the 'nyc-site'.
ja_jp: クライアントは'nyc-site'に接続します。

source: The client connects to the default site.
ja_jp: クライアントはデフォルトのサイトに接続します。

source: The client id (from the service account)
ja_jp: クライアント ID (サービスアカウントから)

source: The client name set through annotation has higher priority than the `quarkus.rest-client-oidc-filter.client-name` configuration property.
ja_jp: アノテーションによって設定されたクライアント名は、 `quarkus.rest-client-oidc-filter.client-name` 設定プロパティーよりも優先されます。

source: The client name set through annotation has higher priority than the `quarkus.resteasy-client-oidc-filter.client-name` configuration property.
ja_jp: アノテーションによって設定されたクライアント名は、 `quarkus.resteasy-client-oidc-filter.client-name` 設定プロパティーよりも優先されます。

source: The client needs to be configured with a truststore to validate the server's certificate
ja_jp: サーバーの証明書を検証するために、クライアントにトラストストアを設定する必要があります。

source: The client needs to be configured with a truststore to validate the server's certificate.
ja_jp: サーバーの証明書を検証するために、クライアントにトラストストアを設定する必要があります。

source: The client secret (from the service account)
ja_jp: クライアントシークレット (サービスアカウントから)

source: The client secret key
ja_jp: クライアントシークレットキー

source: The client uses `client_credentials` that requires client id and secret or password grant, which requires client id, secret, username, and password to retrieve the access token from the OIDC provider.
ja_jp: クライアントが、 `client_credentials` かパスワードグラントを使用して、OIDC プロバイダーからアクセストークンを取得します。client_credentials には、クライアント ID とシークレットが必要です。パスワードグラントには、クライアント ID、シークレット、ユーザー名、およびパスワードが必要です。

source: The client uses the access token to retrieve the service data from the Quarkus service.
ja_jp: クライアントがアクセストークンを使用して、Quarkus サービスからサービスデータを取得します。

source: The client will handle all the networking and marshalling leaving our code clean of such technical details.
ja_jp: ネットワーキングやマーシャリングはすべてクライアントが行うので、私たちのコードにはそのような技術的な詳細は含まれません。

source: The client-server architecture has been the de-facto standard for building applications for years. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, function as a service, and AI-infused applications are now central players in modern systems.
ja_jp: クライアント サーバー アーキテクチャーは、長年にわたりアプリケーション構築のデファクト スタンダードでした。しかし、大きな変化が起こりました。 <em>1 つのモデルがすべてを支配する</em>時代は終わりました。新しい種類のアプリケーションとアーキテクチャー スタイルが登場し、コードの記述方法やアプリケーションのデプロイ方法、実行方法を変えました。HTTP マイクロサービス、リアクティブ アプリケーション、イベント駆動型アーキテクチャー、サービスとしての機能、AI を組み込んだアプリケーションが、現代のシステムの中心的な担い手となっています。

source: The clients requiring secrets can only be supported with this SPA if a default realm has been created or if `quarkus.oidc.credentials.secret` is configued and a single custom realm is used since in these cases the SPA can figure out the client secret it may need to complete the authorization code flow after Keycloak redorected the user back to it.
ja_jp: シークレットが必要なクライアントは、デフォルトのレルムが作成されている場合、または `quarkus.oidc.credentials.secret` が設定されていて単一のカスタムレルムが使用されている場合にのみ、このSPAでサポートできます。これらの場合、SPA はクライアント シークレットを把握できるためです。 Keycloakがユーザーをリダイレクトした後、認可コードフローを完了する必要がある場合があります。

source: The clients requiring secrets can only be supported with this SPA if a default realm has been created or if `quarkus.oidc.credentials.secret` is configured and a single custom realm is used. In both cases, the SPA can figure out the client secret it might need to complete the authorization code flow after Keycloak redirects the user back to it.
ja_jp: シークレットが必要なクライアントは、デフォルトのレルムが作成されている場合、または `quarkus.oidc.credentials.secret` が設定されていて単一のカスタムレルムが使用されている場合にのみ、この SPA でサポートできます。 どちらの場合も、Keycloak がユーザーを SPA にリダイレクトした後、SPA は認可コードフローを完了するために必要なクライアントシークレットを把握できます。

source: The cloud events headers must be sent via HTTP headers.
ja_jp: クラウドイベントヘッダーは、HTTPヘッダで送信する必要があります。

source: The code
ja_jp: コード

source: The code above is a programmatic equivalent to the following configuration in the `application.properties` file:
ja_jp: 上記のコードは、`application.properties` ファイル内の次の設定とプログラム的に同等です。

source: The code above uses link:http://rest-assured.io/[REST Assured] to assert that the returned content from the echo service contains multipart elements
ja_jp: 上記のコードでは、 link:http://rest-assured.io/[REST Assured] を使用して、エコーサービスから返されるコンテンツにマルチパート要素が含まれていることを表明しています。

source: The code above uses link:http://rest-assured.io/[REST Assured]'s link:https://github.com/rest-assured/rest-assured/wiki/GettingStarted#jsonpath[json-path] capabilities.
ja_jp: 上のコードでは、 link:http://rest-assured.io/[REST Assured] の link:https://github.com/rest-assured/rest-assured/wiki/GettingStarted#jsonpath[json-path] 機能を使用しています。

source: The code above uses link:https://rest-assured.io/[REST Assured] to assert that the returned content from the echo service contains multipart elements
ja_jp: 上記のコードでは、 link:http://rest-assured.io/[REST Assured]を使用して、エコーサービスから返されるコンテンツにマルチパート要素が含まれていることをアサートしています。

source: The code above uses link:https://rest-assured.io/[REST Assured]'s link:https://github.com/rest-assured/rest-assured/wiki/GettingStarted#jsonpath[json-path] capabilities.
ja_jp: 上のコードでは、 link:http://rest-assured.io/[REST Assured] の link:https://github.com/rest-assured/rest-assured/wiki/GettingStarted#jsonpath[json-path] 機能を使用しています。

source: The code below demonstrates how to use each of these techniques:
ja_jp: 以下のコードは、これらの各手法の使用方法を示しています。

source: The code below demonstrates the change in `env-vars` config:
ja_jp: 以下のコードは `env-vars` の設定を変更した様子を示しています:

source: The code below demonstrates the change in `labels` config:
ja_jp: 以下のコードは `labels` の設定を変更した様子を示しています:

source: The code changes
ja_jp: コードの変更

source: The code for the `RuntimeXmlConfigService` can be viewed here: {quarkus-blob-url}/core/test-extension/runtime/src/main/java/io/quarkus/extest/runtime/RuntimeXmlConfigService.java[RuntimeXmlConfigService.java]
ja_jp: `RuntimeXmlConfigService` のコードはここで見ることができます: {quarkus-blob-url}/core/test-extension/runtime/src/main/java/io/quarkus/extest/runtime/RuntimeXmlConfigService.java[RuntimeXmlConfigService.java]

source: The code for the `RuntimeXmlConfigService` can be viewed here: {quarkus-blob-url}/integration-tests/test-extension/extension/runtime/src/main/java/io/quarkus/extest/runtime/RuntimeXmlConfigService.java[RuntimeXmlConfigService.java]
ja_jp: `RuntimeXmlConfigService` のコードは、 {quarkus-blob-url}/integration-tests/test-extension/extension/runtime/src/main/java/io/quarkus/extest/runtime/RuntimeXmlConfigService.java[RuntimeXmlConfigService.java] で確認できます。

source: The code in the `function` runs on the deployment classpath. The function can return a plain value, a `CompletionStage` or `CompletableFuture` for asynchronous work.
ja_jp: `function` 内のコードはデプロイメントクラスパスで実行されます。この関数は、プレーンな値、または非同期処理のための `CompletionStage` もしくは `CompletableFuture` を返すことができます。

source: The code is a bit more involved. To write to a database, we need a transaction, therefore we use `Panache.withTransaction` to obtain one (asynchronously) and proceed to call the `persist` method. The `persist` method returns a `Uni` that emits the result of the insertion of the fruit in the database. Once the insertion completes (which plays the role of the continuation), we create a `201 CREATED` HTTP response.
ja_jp: コードはもう少し複雑です。データベースに書き込むにはトランザクションが必要なので、 `Panache.withTransaction` を使って（非同期に）トランザクションを取得し、 `persist` メソッドを呼び出します。 `persist` メソッドは、フルーツのデータベースへの挿入結果を返す `Uni` を返却します。挿入が完了すると（これが継続の役割を果たす）、 `201 CREATED` HTTPレスポンスを作成します。

source: The code is a bit more involved. To write to a database, we need a transaction. So we use `Panache.withTransaction` to get one (asynchronously) and call the `persist` method when we receive the transaction. The `persist` method is also returning a `Uni`. This `Uni` emits the result of the insertion of the fruit in the database. Once the insertion completes (and that's our continuation), we create a `201 CREATED` response. RESTEasy Reactive automatically reads the request body as JSON and creates the `Fruit` instance.
ja_jp: コードはもう少し複雑になっています。データベースへの書き込みには、トランザクションが必要です。そこで、 `Panache.withTransaction` を使って（非同期に）トランザクションを取得し、トランザクションを受け取ったら `persist` メソッドを呼び出します。 `persist` メソッドも `Uni` を返しています。この `Uni` は、データベースにフルーツを挿入した結果を出力します。挿入が完了すると（これが私たちの継続です）、 `201 CREATED` レスポンスを作成します。RESTEasy Reactiveは自動的にリクエスト・ボディをJSONとして読み込み、 `Fruit` インスタンスを作成します。

source: The code is pretty straightforward. Every 10 seconds, the counter is incremented.
ja_jp: コードはとても簡単です。10 秒ごとにカウンタがインクリメントされます。

source: The code is pretty straightforward. Every day at 10:15am, the counter is incremented.
ja_jp: コードはとても簡単です。毎日、午前10時15分になると、カウンターが増加します。

source: The code of the application developed in the xref:getting-started.adoc[Getting Started Guide].
ja_jp: xref:getting-started.adoc[入門ガイド] で開発したアプリケーションのコード。

source: The code presented in this guide is available in this {quickstarts-base-url}[GitHub repository] under the link:{quickstarts-tree-url}/reactive-routes-quickstart[`reactive-routes-quickstart` directory]
ja_jp: このガイドで紹介するコードは、この {quickstarts-base-url}[GitHubリポジトリ] の link:{quickstarts-tree-url}/reactive-routes-quickstart[reactive-routes-quickstart ディレクトリ] にあります。

source: The code presented in this guide is available in this {quickstarts-base-url}[GitHub repository] under the {quickstarts-tree-url}/reactive-routes-quickstart[`reactive-routes-quickstart` directory]
ja_jp: このガイドで紹介するコードは、この{quickstarts-base-url}[GitHub リポジトリ]の{quickstarts-tree-url}/reactive-routes-quickstart[ `reactive-routes-quickstart` ディレクトリ]にあります。

source: The code uses the following pieces:
ja_jp: コードでは次の部分を使用します。

source: The codebase is smaller, tighter, and easier to work with
ja_jp: コードベースが小さくなり、タイトになり、作業しやすくなりました

source: The codestart should not include any business logic, instead, it should contain some stub data/hello world to compile. The idea is to bring code that is the starting point to everyone using the extension.
ja_jp: codestartにはビジネスロジックは含まれず、代わりにスタブデータやコンパイルされるhello worldが含まれている必要があります。このアイデアは、エクステンションを使用するすべての人に、出発点となるコードを提供することです。

source: The codestarts are all grouped in a https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[specific module, window="_blank"].
ja_jp: Codestart はすべて https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[特定のモジュール, window="_blank"] のグループにあります。

source: The collected metrics contain cache statistics such as:
ja_jp: 収集されたメトリクスには、以下のようなキャッシュの統計情報が含まれています。

source: The colon character `:` needs to be escaped in `.properties` files as `\:`, or it will be interpreted as a key/value separator.
ja_jp: コロン文字 `:` は、`.properties` ファイル内で `\:` のようにエスケープする必要があります。そうしないと、キー/値セパレーターとして解釈されます。

source: The combination of Quarkus and Kubernetes provides an ideal environment for creating scalable, fast, and lightweight applications. Quarkus significantly increases developer productivity with tooling, pre-built integrations, application services, and more.
ja_jp: QuarkusとKubernetesの組み合わせは、スケーラブルで高速、かつ軽量なアプリケーションを作成するための理想的な環境を提供します。Quarkusは、ツール、事前に構築された統合、アプリケーションサービスなどにより、開発者の生産性を大幅に向上させます。

source: The combination of the build time optimization and reactive core makes Quarkus a highly efficient framework, excelling in several key areas:
ja_jp: ビルド時最適化とリアクティブコアの組み合わせにより、Quarkusは非常に効率的なフレームワークとなり、いくつかの主要な分野で優れています。

source: The combination of username and credential ID should be a unicity constraint for your credentials table, though.
ja_jp: ただし、ユーザー名とクレデンシャルIDの組み合わせは、クレデンシャルテーブルのユニーク制約である必要があります。

source: The comma-separated set of cleared contexts
ja_jp: クリアされたコンテキストのコンマで区切りのセット

source: The comma-separated set of propagated contexts
ja_jp: 伝播されたコンテキストのコンマで区切られたセット

source: The comma-separated set of unchanged contexts
ja_jp: 変更されていないコンテキストのコンマで区切られたセット

source: The command above installed a plugin by `name` using the name as listed by `quarkus plugin list --installable`.
ja_jp: 上記のコマンドにより、 `quarkus plugin list --installable` でリストされた名前を使用して、 `name` でプラグインがインストールされました。

source: The command above will add `MY_ENV_VAR=foobar` as an environment variable. Please note that the key `my-env-var` will be converted to uppercase and dashes will be replaced by underscores resulting in `MY_ENV_VAR`.
ja_jp: 上のコマンドは `MY_ENV_VAR=foobar` を環境変数として追加します。キー `my-env-var` は大文字に変換され、ダッシュはアンダースコアに置き換えられて `MY_ENV_VAR` となることに注意してください。

source: The command above, if run successfully, will give you the address of your container in the Cloud. Access your Quarkus application in the address displayed as output.
ja_jp: 上記のコマンドの実行が成功すると、クラウド上のコンテナーのアドレスが表示されます。出力として表示されるアドレスでQuarkusアプリケーションにアクセスします。

source: The command also generates a `.env` file alongside the certificate so Quarkus dev mode can detect these certificates.
ja_jp: このコマンドは、証明書とともに `.env` ファイルも生成するため、Quarkus 開発モードでこれらの証明書を検出できます。

source: The command mode lifecycle
ja_jp: コマンドモードのライフサイクル

source: The command will run with the `prod-aws` profile. This can be overridden using the `quarkus.profile` configuration.
ja_jp: コマンドは、 `prod-aws` プロファイルで実行されます。これは `quarkus.profile` 設定を使用して上書きすることができます。

source: The common cookie properties impact both the authorization code flow session and state cookies.
ja_jp: 共通 Cookie プロパティーは、認可コードフローのセッション Cookie と State Cookie の両方に影響を与えます。

source: The communication details between the IDE and the language servers are seen in the "LSP consoles" pane. In `verbose` mode, the messages can be expanded for more details:
ja_jp: IDEと言語サーバー間の通信の詳細は、"LSP consoles "ペインで確認できます。 `verbose` モードでは、メッセージを拡大して詳細を見ることができます：

source: The community is already aligning its development with the cutting edge of the Quarkus roadmap, including the forthcoming Quarkus 4 major release. This alignment guarantees that Polaris will continually benefit from performance gains, new cloud-native APIs, and the most advanced capabilities for its reactive core.
ja_jp: コミュニティーはすでに、次期メジャーリリースであるQuarkus 4を含む、Quarkusロードマップの最先端に合わせて開発を進めています。この連携により、Polarisはパフォーマンスの向上、新しいクラウドネイティブAPI、およびリアクティブコア向けの最も高度な機能を継続的に利用できるようになります。

source: The community will fix security bugs for the latest major.minor version published at https://quarkus.io/get-started/.
ja_jp: コミュニティは、 https://quarkus.io/get-started/ で公開されている最新の major.minor バージョンのセキュリティーバグを修正します。

source: The companion object holds all the methods not related to a specific instance allowing for general management and querying bound to a specific type.
ja_jp: コンパニオンオブジェクトは、特定のインスタンスに関連しないすべてのメソッドを保持し、特定の型にバインドされた一般的な管理とクエリを可能にします。

source: The comparison between `Quarkus native 180 Mb` and `50 Mb` was interesting as well, because it showed that by pushing up and down the memory and CPU knobs we could work on the use case execution duration. It was then up to us to decide where was the sweet spot between execution time and resource consumption.
ja_jp: `Quarkus native 180 Mb` と `50 Mb` の比較も興味深いものでした。というのも、メモリと CPU のノブを上げ下げすることで、ユースケースの実行時間を調整できることがわかったからです。実行時間とリソース消費の間のスイートスポットをどこに設定するかは、私たち次第です。

source: The compatibility layer for MP Metrics APIs will move to a different extension in the future.
ja_jp: MP Metrics API の互換性レイヤは、将来的には別のエクステンションに移行する予定です。

source: The compilation step is pretty straightforward, it simply compiles all the reachable code.
ja_jp: コンパイルのステップは非常に簡単で、到達可能なすべてのコードを単純にコンパイルします。

source: The complete code is available from https://github.com/cescoffier/getting-started-quarkus-amqp[GitHub].
ja_jp: 完全なコードは link:https://github.com/cescoffier/getting-started-quarkus-amqp[GitHub] から入手できます。

source: The complete code is available from https://github.com/cescoffier/getting-started-quarkus-kafka[GitHub].
ja_jp: 完全なコードは link:https://github.com/cescoffier/getting-started-quarkus-kafka[GitHub]から入手できます。

source: The complete code of the application and the tests are available in the https://github.com/quarkusio/virtual-threads-demos/tree/main/crud-example[virtual threads demos repository].
ja_jp: アプリケーションの完全なコードとテストは、 link:https://github.com/quarkusio/virtual-threads-demos/tree/main/crud-example[virtual threads demosリポジトリ] で入手できる。

source: The complete example is available in the `kafka-panache-quickstart` link:{quickstarts-tree-url}/kafka-panache-quickstart[directory].
ja_jp: 完全な例は、 `kafka-panache-quickstart` link:{quickstarts-tree-url}/kafka-panache-quickstart[ディレクトリー] で入手可能です。

source: The complete example is available in the `kafka-panache-quickstart` {quickstarts-tree-url}/kafka-panache-quickstart[directory].
ja_jp: 完全な例は `kafka-panache-quickstart` {quickstarts-tree-url}/kafka-panache-quickstart[ディレクトリー] にあります。

source: The complete https://maven.apache.org/settings.html#repositories[Maven repository configuration] of <<registry.quarkus.io,registry.quarkus.io>> is
ja_jp: <<registry.quarkus.io,registry.quarkus.io>> の link:https://maven.apache.org/settings.html#repositories[Mavenリポジトリ設定] は以下の通りです。

source: The complete https://maven.apache.org/settings.html#repositories[Maven repository configuration] of xref:registry.quarkus.io[registry.quarkus.io] is
ja_jp: xref:registry.quarkus.io[registry.quarkus.io] の完全なlink:https://maven.apache.org/settings.html#repositories[Maven リポジトリ設定] は次のとおりです。

source: The complete list of externalized variables for use is given in the following table:
ja_jp: 使用する外部化変数の完全なリストを次の表に示します。

source: The complete set of parameters and their description can be obtained by executing `mvn help:describe -Dcmd=quarkus:dependency-sbom -Ddetail`.
ja_jp: `mvn help:describe -Dcmd=quarkus:dependency-sbom -Ddetail` を実行すると、完全なパラメーターセットとその説明を取得できます。
